In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import os
from collections import Counter 
#print(os.listdir("../input"))

In [2]:
path_dz = "C:\\Users\\dmitryzh\\skillfactory_rds\\skillfactory_rds\\module_1\\"
data = pd.read_csv(path_dz+'data.csv')
data.head(5)

,imdb_id,popularity,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_count,vote_average,release_year
0,tt0369610,32.985763,150000000,1513528810,Jurassic World,Chris Pratt|Bryce Dallas Howard|Irrfan Khan|Vi...,Colin Trevorrow,The park is open.,Twenty-two years after the events of Jurassic ...,124,Action|Adventure|Science Fiction|Thriller,Universal Studios|Amblin Entertainment|Legenda...,6/9/2015,5562,6.5,2015
1,tt1392190,28.419936,150000000,378436354,Mad Max: Fury Road,Tom Hardy|Charlize Theron|Hugh Keays-Byrne|Nic...,George Miller,What a Lovely Day.,An apocalyptic story set in the furthest reach...,120,Action|Adventure|Science Fiction|Thriller,Village Roadshow Pictures|Kennedy Miller Produ...,5/13/2015,6185,7.1,2015
2,tt2908446,13.112507,110000000,295238201,Insurgent,Shailene Woodley|Theo James|Kate Winslet|Ansel...,Robert Schwentke,One Choice Can Destroy You,Beatrice Prior must confront her inner demons ...,119,Adventure|Science Fiction|Thriller,Summit Entertainment|Mandeville Films|Red Wago...,3/18/2015,2480,6.3,2015
3,tt2488496,11.173104,200000000,2068178225,Star Wars: The Force Awakens,Harrison Ford|Mark Hamill|Carrie Fisher|Adam D...,J.J. Abrams,Every generation has a story.,Thirty years after defeating the Galactic Empi...,136,Action|Adventure|Science Fiction|Fantasy,Lucasfilm|Truenorth Productions|Bad Robot,12/15/2015,5292,7.5,2015
4,tt2820852,9.335014,190000000,1506249360,Furious 7,Vin Diesel|Paul Walker|Jason Statham|Michelle ...,James Wan,Vengeance Hits Home,Deckard Shaw seeks revenge against Dominic Tor...,137,Action|Crime|Thriller,Universal Pictures|Original Film|Media Rights ...,4/1/2015,2947,7.3,2015

In [3]:
len(data)

1890

In [4]:
data.describe()

,popularity,budget,revenue,runtime,vote_count,vote_average,release_year
count,1890.000000,1.890000e+03,1.890000e+03,1890.000000,1890.000000,1890.000000,1890.000000
mean,1.560611,5.450696e+07,1.552890e+08,109.653439,785.666667,6.140899,2007.861905
std,1.849471,4.931705e+07,2.146386e+08,18.013641,1068.725880,0.764584,4.467929
min,0.010335,5.000000e+06,2.033165e+06,63.000000,10.000000,3.300000,2000.000000
25%,0.643284,2.000000e+07,3.434007e+07,97.000000,164.000000,5.600000,2004.000000
50%,1.065065,3.800000e+07,8.358664e+07,106.500000,389.000000,6.100000,2008.000000
75%,1.804537,7.200000e+07,1.782136e+08,120.000000,937.750000,6.600000,2012.000000
max,32.985763,4.250000e+08,2.781506e+09,214.000000,9767.000000,8.100000,2015.000000

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1890 entries, 0 to 1889
Data columns (total 16 columns):
imdb_id                 1890 non-null object
popularity              1890 non-null float64
budget                  1890 non-null int64
revenue                 1890 non-null int64
original_title          1890 non-null object
cast                    1890 non-null object
director                1890 non-null object
tagline                 1890 non-null object
overview                1890 non-null object
runtime                 1890 non-null int64
genres                  1890 non-null object
production_companies    1890 non-null object
release_date            1890 non-null object
vote_count              1890 non-null int64
vote_average            1890 non-null float64
release_year            1890 non-null int64
dtypes: float64(2), int64(5), object(9)
memory usage: 236.4+ KB

##### пригодятся в дальнейшем ...

In [6]:
data['profit'] = data['revenue'] - data['budget']

In [7]:
data['index_to_column'] = data.index

In [8]:
data['release_month'] = data.release_date.apply(lambda x: int(x[ : (x.find('/'))]) )
#data

# Предобработка датасета

In [9]:
answer_ls = [] # создадим список с ответами. сюда будем добавлять ответы по мере прохождения теста
# сюда можем вписать создание новых колонок в датасете

# 1. У какого фильма из списка самый большой бюджет?
Варианты ответов:
1. The Dark Knight Rises (tt1345836)
2. Spider-Man 3 (tt0413300)
3. Avengers: Age of Ultron (tt2395427)
4. The Warrior's Way	(tt1032751)
5. Pirates of the Caribbean: On Stranger Tides (tt1298650)

In [10]:
# тут вводим ваш ответ и добавлем в его список ответов (сейчас для примера стоит "1")
answer_ls.append(4)

In [11]:
data[data.budget == data.budget.max()] [['imdb_id','original_title','budget']]

       imdb_id     original_title     budget
491  tt1032751  The Warrior's Way  425000000

# 2. Какой из фильмов самый длительный (в минутах)
1. The Lord of the Rings: The Return of the King	(tt0167260)
2. Gods and Generals	(tt0279111)
3. King Kong	(tt0360717)
4. Pearl Harbor	(tt0213149)
5. Alexander	(tt0346491)

In [12]:
answer_ls.append(2)

In [13]:
data[data.runtime == data.runtime.max()] [['imdb_id','original_title','runtime']]

        imdb_id     original_title  runtime
1158  tt0279111  Gods and Generals      214

# 3. Какой из фильмов самый короткий (в минутах)
Варианты ответов:

1. Home on the Range	tt0299172
2. The Jungle Book 2	tt0283426
3. Winnie the Pooh	tt1449283
4. Corpse Bride	tt0121164
5. Hoodwinked!	tt0443536

In [14]:
answer_ls.append(3)

In [15]:
data[data.runtime == data.runtime.min()] [['imdb_id','original_title','runtime']]

       imdb_id   original_title  runtime
769  tt1449283  Winnie the Pooh       63

In [16]:
data[['imdb_id','original_title','runtime']].sort_values('runtime').head(1)

       imdb_id   original_title  runtime
769  tt1449283  Winnie the Pooh       63

# 4. Средняя длительность фильма?

Варианты ответов:
1. 115
2. 110
3. 105
4. 120
5. 100

In [17]:
answer_ls.append(2)

In [18]:
data.runtime.mean()

109.65343915343915

# 5. Средняя длительность фильма по медиане?
Варианты ответов:
1. 106
2. 112
3. 101
4. 120
5. 115

In [19]:
answer_ls.append(1)

In [20]:
data.runtime.quantile(0.5)

106.5

# 6. Какой самый прибыльный фильм?
Варианты ответов:
1. The Avengers	tt0848228
2. Minions	tt2293640
3. Star Wars: The Force Awakens	tt2488496
4. Furious 7	tt2820852
5. Avatar	tt0499549

In [21]:
answer_ls.append(5)

In [22]:
data[data.revenue == data.revenue.max()] [['imdb_id','original_title','revenue']]

       imdb_id original_title     revenue
239  tt0499549         Avatar  2781505847

In [23]:
#data[['imdb_id','original_title','budget','revenue']]
#data['profit'] = data['revenue'] - data['budget']
data[['imdb_id','original_title','budget','revenue','profit']].sort_values('profit').tail(1)

       imdb_id original_title     budget     revenue      profit
239  tt0499549         Avatar  237000000  2781505847  2544505847

# 7. Какой фильм самый убыточный?
Варианты ответов:
1. Supernova tt0134983
2. The Warrior's Way tt1032751
3. Flushed Away	tt0424095
4. The Adventures of Pluto Nash	tt0180052
5. The Lone Ranger	tt1210819

In [24]:
answer_ls.append(2)

In [25]:
#data['profit'] = data['revenue'] - data['budget']
data[data.profit == data.profit.min()] [['imdb_id','original_title','budget','revenue','profit']]

       imdb_id     original_title     budget   revenue     profit
491  tt1032751  The Warrior's Way  425000000  11087569 -413912431

# 8. Сколько всего фильмов в прибыли?
Варианты ответов:
1. 1478
2. 1520
3. 1241
4. 1135
5. 1398

In [26]:
answer_ls.append(1)

In [27]:
data[data.profit > 0] [['imdb_id','original_title','budget','revenue','profit']].profit.count()

1478

In [28]:
data[data.profit > 0] [['imdb_id','original_title','budget','revenue','profit']]

,imdb_id,original_title,budget,revenue,profit
0,tt0369610,Jurassic World,150000000,1513528810,1363528810
1,tt1392190,Mad Max: Fury Road,150000000,378436354,228436354
2,tt2908446,Insurgent,110000000,295238201,185238201
3,tt2488496,Star Wars: The Force Awakens,200000000,2068178225,1868178225
4,tt2820852,Furious 7,190000000,1506249360,1316249360
...,...,...,...,...,...
1872,tt0171433,Keeping the Faith,30000000,37036004,7036004
1876,tt0219854,The Kid,65000000,69700000,4700000
1878,tt0199725,Love & Basketball,20000000,27728118,7728118
1884,tt0122459,Return to Me,24000000,36609995,12609995
1885,tt0120903,X-Men,75000000,157299717,82299717

# 9. Самый прибыльный фильм в 2008 году?
Варианты ответов:
1. Madagascar: Escape 2 Africa	tt0479952
2. Iron Man	tt0371746
3. Kung Fu Panda	tt0441773
4. The Dark Knight	tt0468569
5. Mamma Mia!	tt0795421

In [29]:
answer_ls.append(4)

In [30]:
data[ (data.profit > 0 ) & (data.release_year == 2008)          #data.release_date.str.contains('2008'))
    ] [['imdb_id','original_title','release_date','profit']].sort_values('profit', ascending=False).head(1)

       imdb_id   original_title release_date     profit
600  tt0468569  The Dark Knight    7/16/2008  816921825

# 10. Самый убыточный фильм за период с 2012 по 2014 (включительно)?
Варианты ответов:
1. Winter's Tale	tt1837709
2. Stolen	tt1656186
3. Broken City	tt1235522
4. Upside Down	tt1374992
5. The Lone Ranger	tt1210819

In [31]:
answer_ls.append(5)

In [32]:
data[ 
    (data.release_year >= 2012) & (data.release_year <= 2014) 
    ] [['imdb_id','original_title','release_date','budget','revenue','release_year','profit']
      ].sort_values('profit').head(1)

,imdb_id,original_title,release_date,budget,revenue,release_year,profit
1246,tt1210819,The Lone Ranger,7/3/2013,255000000,89289910,2013,-165710090

# 11. Какого жанра фильмов больше всего?
Варианты ответов:
1. Action
2. Adventure
3. Drama
4. Comedy
5. Thriller

In [33]:
answer_ls.append(3)

In [34]:
pd.DataFrame(data.genres.str.split('|').tolist()).stack().value_counts()

Drama              782
Comedy             683
Thriller           597
Action             583
Adventure          416
Crime              315
Romance            308
Family             260
Science Fiction    248
Fantasy            223
Horror             176
Mystery            168
Animation          139
Music               64
History             62
War                 58
Western             20
Documentary          8
Foreign              2
dtype: int64

In [35]:
genre_counter = Counter()
for x in data.genres.str.split('|'):
    genre_counter += Counter(x)
    
genre_counter.most_common()

[('Drama', 782),
 ('Comedy', 683),
 ('Thriller', 597),
 ('Action', 583),
 ('Adventure', 416),
 ('Crime', 315),
 ('Romance', 308),
 ('Family', 260),
 ('Science Fiction', 248),
 ('Fantasy', 223),
 ('Horror', 176),
 ('Mystery', 168),
 ('Animation', 139),
 ('Music', 64),
 ('History', 62),
 ('War', 58),
 ('Western', 20),
 ('Documentary', 8),
 ('Foreign', 2)]

# 12. Какого жанра среди прибыльных фильмов больше всего?
Варианты ответов:
1. Drama
2. Comedy
3. Action
4. Thriller
5. Adventure

In [36]:
answer_ls.append(1)

In [37]:
pd.DataFrame(data[data.profit > 0].genres.str.split('|').tolist()).stack().value_counts()

Drama              560
Comedy             551
Thriller           446
Action             444
Adventure          337
Romance            242
Crime              231
Family             226
Science Fiction    195
Fantasy            188
Horror             150
Animation          120
Mystery            119
Music               47
History             46
War                 41
Western             12
Documentary          7
dtype: int64

# 13. Кто из режиссеров снял больше всего фильмов?
Варианты ответов:
1. Steven Spielberg
2. Ridley Scott 
3. Steven Soderbergh
4. Christopher Nolan
5. Clint Eastwood

In [38]:
answer_ls.append(3)

In [39]:
pd.DataFrame(  data.director.str.split('|').tolist()  ).stack().value_counts()

Steven Soderbergh        13
Clint Eastwood           12
Ridley Scott             12
Robert Rodriguez         11
Steven Spielberg         10
                         ..
Rob Pritts                1
Jonathan M. Goldstein     1
Joby Harold               1
Danny Pang                1
Xavier Gens               1
Length: 998, dtype: int64

# 14. Кто из режиссеров снял больше всего Прибыльных фильмов?
Варианты ответов:
1. Steven Soderbergh
2. Clint Eastwood
3. Steven Spielberg
4. Ridley Scott
5. Christopher Nolan

In [40]:
answer_ls.append(4)

In [41]:
pd.DataFrame(data[data.profit > 0].director.str.split('|').tolist()).stack().value_counts()

Ridley Scott         12
Steven Spielberg     10
Clint Eastwood       10
Steven Soderbergh    10
Tim Burton            9
                     ..
Doug Ellin            1
Roger Donaldson       1
Michael Hoffman       1
Mike Tollin           1
Xavier Gens           1
Length: 814, dtype: int64

# 15. Кто из режиссеров принес больше всего прибыли?
Варианты ответов:
1. Steven Spielberg
2. Christopher Nolan
3. David Yates
4. James Cameron
5. Peter Jackson

In [42]:
answer_ls.append(5)

In [43]:
dirdata = pd.DataFrame(data.director.str.split('|').tolist()).stack().reset_index() 

dirdata.columns =  ['t1', 't2', 'director']
#display(dirdata)
#display(dirdata.groupby(['director'])['t1'].nunique().sort_values(ascending=False)  )
dirdata['dirprofit'] = dirdata.t1.apply(lambda x: data.iloc[x]['profit'])
#display(dirdata.sort_values('director').head(20))
#display(data.iloc[2]['profit']  )
dirdata.groupby(['director'])['dirprofit'].sum().sort_values(ascending=False)

director
Peter Jackson        5202593685
David Yates          3379295625
Christopher Nolan    3162548502
J.J. Abrams          2839169916
Michael Bay          2760938960
                        ...
Peter Hyams           -86956545
Ron Underwood         -92896027
James L. Brooks       -96289726
Walter Hill          -128283462
Sngmoo Lee           -413912431
Name: dirprofit, Length: 998, dtype: int64

# 16. Какой актер принес больше всего прибыли?
Варианты ответов:
1. Emma Watson
2. Johnny Depp
3. Michelle Rodriguez
4. Orlando Bloom
5. Rupert Grint

In [44]:
answer_ls.append(1)

In [45]:
adata = pd.DataFrame(data.cast.str.split('|').tolist()).stack().reset_index() 
adata.columns =  ['t1', 't2', 'actor'] 
#display(adata)
adata['aprofit'] = adata.t1.apply(lambda x: data.iloc[x]['profit'])
#display(adata)
adata.groupby(['actor'])['aprofit'].sum().sort_values(ascending=False)

actor
Emma Watson           6666245597
Daniel Radcliffe      6514990281
Rupert Grint          6408638290
Ian McKellen          6087375777
Robert Downey Jr.     5316030161
                         ...
Elisabeth Harnois     -111007242
Emilio EchevarrÃ­a    -119180039
Kate Bosworth         -369455668
Ti Lung               -413912431
Jang Dong-gun         -413912431
Name: aprofit, Length: 3408, dtype: int64

# 17. Какой актер принес меньше всего прибыли в 2012 году?
Варианты ответов:
1. Nicolas Cage
2. Danny Huston
3. Kirsten Dunst
4. Jim Sturgess
5. Sami Gayle

In [46]:
answer_ls.append(3)

In [47]:
actor_data = pd.DataFrame(data.cast.str.split('|').tolist()).stack().reset_index() 
actor_data.columns =  ['t1', 't2', 'actor1']
#display(actor_data.head(20)) 
actor_df = actor_data.merge(data, how = 'left', left_on = 't1', right_on='index_to_column')
#display(actor_df.head())
actor_df2 = actor_df[actor_df.release_year == 2012]
#display(actor_df2.head())
actor_df2.groupby(['actor1'])['profit'].sum().sort_values(ascending=False)

actor1
Chris Hemsworth      1542450773
Denis Leary          1319460639
Chris Evans          1299557910
Mark Ruffalo         1299557910
Robert Downey Jr.    1299557910
                        ...
Malin Ã…kerman        -43733509
Timothy Spall         -51893525
James Kidnie          -51893525
Heidi Hawkins         -51893525
Kirsten Dunst         -68109207
Name: profit, Length: 466, dtype: int64

# 18. Какой актер снялся в большем количестве высокобюджетных фильмов? (в фильмах где бюджет выше среднего по данной выборке)
Варианты ответов:
1. Tom Cruise
2. Mark Wahlberg 
3. Matt Damon
4. Angelina Jolie
5. Adam Sandler

In [48]:
answer_ls.append(3)

In [49]:
data_h = data[  data['budget'] > data['budget'].mean()  ]
pd.DataFrame(data_h.cast.str.split('|').tolist()).stack().value_counts()

Matt Damon         18
Adam Sandler       17
Angelina Jolie     16
Eddie Murphy       15
Tom Cruise         15
                   ..
Rob Riggle          1
Britt Robertson     1
David Harbour       1
Kevin McNally       1
Julie Kavner        1
Length: 1508, dtype: int64

# 19. В фильмах какого жанра больше всего снимался Nicolas Cage?  
Варианты ответа:
1. Drama
2. Action
3. Thriller
4. Adventure
5. Crime

In [50]:
answer_ls.append(2)

Фильтруете датафрейм сразу data[data.cast.map(lambda x: True if 'Nicolas Cage' in x else False)]
В этом отфильтрованном датафрейме  в столбце genres можно обратить внимание на метод str.cat с разделителем '|', потом уже split('|'). Ну и value_counts)

In [51]:
nc = data[data.cast.map(lambda x: True if 'Nicolas Cage' in x else False)]
nc
pd.DataFrame(nc.genres.str.split('|').tolist()).stack().value_counts()

Action             17
Thriller           15
Drama              12
Crime              10
Fantasy             8
Adventure           7
Comedy              6
Science Fiction     4
Animation           3
Family              3
Mystery             3
History             2
War                 1
Romance             1
Horror              1
dtype: int64

# 20. Какая студия сняла больше всего фильмов?
Варианты ответа:
1. Universal Pictures (Universal)
2. Paramount Pictures
3. Columbia Pictures
4. Warner Bros
5. Twentieth Century Fox Film Corporation

In [52]:
answer_ls.append(1)

In [53]:
pd.DataFrame(data.production_companies.str.split('|').tolist()).stack().value_counts()

Universal Pictures                        173
Warner Bros.                              168
Paramount Pictures                        122
Columbia Pictures                         117
Twentieth Century Fox Film Corporation    109
                                         ...
Nigel Productions                           1
Babbo Inc.                                  1
Flyboys Films                               1
JD Productions                              1
Infinite Frameworks Studios                 1
Length: 1772, dtype: int64

# 21. Какая студия сняла больше всего фильмов в 2015 году?
Варианты ответа:
1. Universal Pictures
2. Paramount Pictures
3. Columbia Pictures
4. Warner Bros
5. Twentieth Century Fox Film Corporation

In [54]:
answer_ls.append(4)

In [55]:
pd.DataFrame(data[data.release_year == 2015].production_companies.str.split('|').tolist()).stack().value_counts()

Warner Bros.                              12
Universal Pictures                        10
Twentieth Century Fox Film Corporation     8
Paramount Pictures                         7
Columbia Pictures                          7
                                          ..
BenderSpink                                1
Twentieth Century Fox Animation            1
Zippcast Films                             1
Huayi Brothers Media                       1
Mid Atlantic Films                         1
Length: 246, dtype: int64

# 22. Какая студия заработала больше всего денег в жанре комедий за все время?
Варианты ответа:
1. Warner Bros
2. Universal Pictures (Universal)
3. Columbia Pictures
4. Paramount Pictures
5. Walt Disney

In [56]:
answer_ls.append(2)

In [57]:
comedy_df = data[  data.genres.map(lambda x: True if 'Comedy' in x else False)  ] 

prodco_data = pd.DataFrame(comedy_df.production_companies.str.split('|').tolist()).stack().reset_index()
prodco_data.columns =  ['t1', 't2', 'prodco1']
#display(prodco_data.head(20))

prodco_df = prodco_data.merge(data, how = 'left', left_on = 't1', right_on='index_to_column')
#display(prodco_df.head(20))
prodco_df.groupby(['prodco1'])['profit'].sum().sort_values(ascending=False)

prodco1
Universal Pictures          9760457818
Columbia Pictures           8273198775
Paramount Pictures          6485616061
Walt Disney Pictures        6321695456
New Line Cinema             6270749300
                               ...
AR-TL                        -69590483
Hammer & Tongs               -71331093
Jon Shestack Productions     -80445998
Red Hour Films              -124500164
Room 9 Entertainment        -413912431
Name: profit, Length: 702, dtype: int64

# 23. Какая студия заработала больше всего денег в 2012 году?
Варианты ответа:
1. Universal Pictures (Universal)
2. Warner Bros
3. Columbia Pictures
4. Paramount Pictures
5. Lucasfilm

In [58]:
answer_ls.append(3)

In [59]:
prodco_data = pd.DataFrame(data[data.release_year == 2012].production_companies.str.split('|').tolist()
                          ).stack().reset_index()
prodco_data.columns =  ['t1', 't2', 'prodco1']
#display(prodco_data.head(20))

prodco_df = prodco_data.merge(data, how = 'left', left_on = 't1', right_on='index_to_column')
#display(  prodco_df[prodco_df.prodco1 == 'Columbia Pictures' ])#.sort_values('prodco1',ascending=False).head(20)  )

prodco_df.groupby(['prodco1'])['profit'].sum().sort_values(ascending=False)

prodco1
Columbia Pictures                         4444069245
The Weinstein Company                     3201077867
Relativity Media                          1376032025
Marvel Studios                            1363528810
Twentieth Century Fox Film Corporation    1227723052
                                             ...
Adam Schroeder Productions                 -29581440
Davis Entertainment                        -29581440
Onda Entertainment                         -46675670
Ixtlan                                     -46675670
Sony Pictures Animation                    -73858740
Name: profit, Length: 236, dtype: int64

# 24. Самый убыточный фильм от Paramount Pictures
Варианты ответа:

1. K-19: The Widowmaker tt0267626
2. Next tt0435705
3. Twisted tt0315297
4. The Love Guru tt0811138
5. The Fighter tt0964517

In [60]:
answer_ls.append(1)

In [61]:
para = data[data.production_companies.map(lambda x: True if 'Paramount Pictures' in x else False)]
para
para[para.profit == para.profit.min()] [['imdb_id','original_title','production_companies','profit']]

,imdb_id,original_title,production_companies,profit
926,tt0267626,K-19: The Widowmaker,Paramount Pictures|Intermedia Films|National G...,-64831034

# 25. Какой Самый прибыльный год (заработали больше всего)?
Варианты ответа:
1. 2014
2. 2008
3. 2012
4. 2002
5. 2015

In [62]:
answer_ls.append(5)

In [63]:
data.groupby(['release_year'])['profit'].sum().sort_values(ascending=False)

release_year
2015    18668572378
2014    16397812953
2012    16077001687
2013    15243179791
2011    14730241341
2009    13423744372
2010    13117292530
2008    11663881990
2007    11565911801
2004     9634180720
2003     9228823312
2002     9002361487
2005     8981925558
2006     8691077320
2001     7950614865
2000     6101399805
Name: profit, dtype: int64

# 26. Какой Самый прибыльный год для студии Warner Bros?
Варианты ответа:
1. 2014
2. 2008
3. 2012
4. 2010
5. 2015

In [64]:
answer_ls.append(1)

In [65]:
wb = data[data.production_companies.map(lambda x: True if 'Warner Bros' in x else False)]
wb
wb.groupby(['release_year'])['profit'].sum().sort_values(ascending=False)

release_year
2014    2295464519
2007    2201675217
2008    2134595031
2010    1974712985
2011    1871393682
2003    1855493377
2009    1822454136
2013    1636453400
2004    1631933725
2005    1551980298
2001    1343545668
2012    1258020056
2002    1022709901
2015     870368348
2006     620170743
2000     452631386
Name: profit, dtype: int64

# 27. В каком месяце за все годы суммарно вышло больше всего фильмов?
Варианты ответа:
1. Январь
2. Июнь
3. Декабрь
4. Сентябрь
5. Май

In [66]:
answer_ls.append(4)

In [67]:
data.groupby(['release_month'])['original_title'].count().sort_values(ascending=False)

release_month
9     227
12    191
10    186
8     161
3     156
4     149
6     147
11    146
7     142
5     140
2     135
1     110
Name: original_title, dtype: int64

# 28. Сколько суммарно вышло фильмов летом? (за июнь, июль, август)
Варианты ответа:
1. 345
2. 450
3. 478
4. 523
5. 381

In [68]:
answer_ls.append(2)

In [69]:
leto_df = data[(data.release_month >= 6) & (data.release_month <= 8)]
leto_df[['original_title']].count()
#leto_df.count()

original_title    450
dtype: int64

# 29. Какой режисер выпускает (суммарно по годам) больше всего фильмов зимой?
Варианты ответов:
1. Steven Soderbergh
2. Christopher Nolan
3. Clint Eastwood
4. Ridley Scott
5. Peter Jackson

In [70]:
answer_ls.append(5)

In [71]:
dirdata = pd.DataFrame(data.director.str.split('|').tolist()).stack().reset_index() 
dirdata.columns =  ['t1', 't2', 'dir1'] 

dir_df = dirdata.merge(data, how = 'left', left_on = 't1', right_on='index_to_column')

zima_df = dir_df[(dir_df.release_month >= 12) | (dir_df.release_month <= 2)] 
zima_df.groupby(['dir1']) ['original_title'].count().sort_values(ascending=False)

dir1
Peter Jackson            7
Clint Eastwood           6
Steven Soderbergh        6
Shawn Levy               4
Adam Shankman            4
                        ..
Joseph Kosinski          1
Joseph Kahn              1
Jonathan van Tulleken    1
Jonathan Teplitzky       1
Xavier Palud             1
Name: original_title, Length: 359, dtype: int64

# 30. Какой месяц чаще всего по годам самый прибыльный?
Варианты ответа:
1. Январь
2. Июнь
3. Декабрь
4. Сентябрь
5. Май

In [72]:
answer_ls.append(2)

In [73]:
data.groupby(['release_month'])['profit'].sum().sort_values(ascending=False)

release_month
6     27551262500
12    26563071474
5     25039516141
11    18654155473
7     18307895020
3     13720216540
10    12994907859
4     12876005537
9     10878921041
8      9640610446
2      8854574425
1      5396885454
Name: profit, dtype: int64

# 31. Названия фильмов какой студии в среднем самые длинные по количеству символов?
Варианты ответа:
1. Universal Pictures (Universal)
2. Warner Bros
3. Jim Henson Company, The
4. Paramount Pictures
5. Four By Two Productions

In [74]:
answer_ls.append(5)

In [75]:
prodco_data = pd.DataFrame(data.production_companies.str.split('|').tolist() ).stack().reset_index()
prodco_data.columns =  ['t1', 't2', 'prodco1']
#display(prodco_data.head(20))

prodco_df = prodco_data.merge(data, how = 'left', left_on = 't1', right_on='index_to_column')
#display(  prodco_df[prodco_df.prodco1 == 'Columbia Pictures' ])#.sort_values('prodco1',ascending=False).head(20)  )

prodco_df['title_len']=prodco_df.original_title.apply(lambda x: len(x))
#display(prodco_df)
prodco_df.groupby(['prodco1'])['title_len'].mean().sort_values(ascending=False)

prodco1
Four By Two Productions       83.0
Jim Henson Company, The       59.0
Dos Corazones                 47.0
Polsky Films                  46.0
Museum Canada Productions     46.0
                              ...
Everest Entertainment          3.0
Berlanti Productions           3.0
XM2 Productions                2.0
Ixtlan Productions             2.0
Global Entertainment Group     2.0
Name: title_len, Length: 1772, dtype: float64

# 32. Названия фильмов какой студии в среднем самые длинные по количеству слов?
Варианты ответа:
1. Universal Pictures (Universal)
2. Warner Bros
3. Jim Henson Company, The
4. Paramount Pictures
5. Four By Two Productions

In [76]:
answer_ls.append(5)

In [77]:
prodco_data = pd.DataFrame(data.production_companies.str.split('|').tolist() ).stack().reset_index()
prodco_data.columns =  ['t1', 't2', 'prodco1']
#display(prodco_data.head(20))
prodco_df = prodco_data.merge(data, how = 'left', left_on = 't1', right_on='index_to_column') 
                                                            # len(x.split()) --- количество слов в строке
prodco_df['title_len']=prodco_df.original_title.apply(lambda x: len(x.split())) 
#display(prodco_df)
prodco_df.groupby(['prodco1'])['title_len'].mean().sort_values(ascending=False)

prodco1
Four By Two Productions                  12.0
Jim Henson Company, The                  10.0
Polsky Films                              9.0
The Saul Zaentz Company                   9.0
Dos Corazones                             9.0
                                         ...
Many Rivers Productions                   1.0
Maple Shade Films                         1.0
Blue Productions                          1.0
Blue Sea Productions                      1.0
Great Wight Productions/ Osford Films     1.0
Name: title_len, Length: 1772, dtype: float64

# 33. Сколько разных слов используется в названиях фильмов?(без учета регистра)
Варианты ответа:
1. 6540
2. 1002
3. 2461
4. 28304
5. 3432

In [78]:
answer_ls.append(3)

In [79]:
title_words = pd.DataFrame(data.original_title.str.split().tolist() ).stack().reset_index()
title_words.columns =  ['t1', 't2', 'title_word']
#display(title_words.head(20))
    
title_words['normalised_word'] = title_words.title_word.apply(lambda x: x.lower().strip())
display(title_words.head(10))

title_words.normalised_word.nunique()

   t1  t2 title_word normalised_word
0   0   0   Jurassic        jurassic
1   0   1      World           world
2   1   0        Mad             mad
3   1   1       Max:            max:
4   1   2       Fury            fury
5   1   3       Road            road
6   2   0  Insurgent       insurgent
7   3   0       Star            star
8   3   1      Wars:           wars:
9   3   2        The             the

2461

In [80]:
# --- v2

title_words = pd.DataFrame(data.original_title.str.split().tolist() ).stack().reset_index()
title_words.columns =  ['t1', 't2', 'title_word']
#display(title_words.head(20))

import re

def clean_words(s):    #    --- очистка слова
    reg = re.compile('[^a-z0-9]')
    return reg.sub('', s.lower().strip())
    
title_words['normalised_word'] = title_words.title_word.apply(lambda x: clean_words(x) )
display(title_words.head(10))

title_words.normalised_word.nunique()

   t1  t2 title_word normalised_word
0   0   0   Jurassic        jurassic
1   0   1      World           world
2   1   0        Mad             mad
3   1   1       Max:             max
4   1   2       Fury            fury
5   1   3       Road            road
6   2   0  Insurgent       insurgent
7   3   0       Star            star
8   3   1      Wars:            wars
9   3   2        The             the

2359

# 34. Какие фильмы входят в 1 процент лучших по рейтингу?
Варианты ответа:
1. Inside Out, Gone Girl, 12 Years a Slave
2. BloodRayne, The Adventures of Rocky & Bullwinkle
3. The Lord of the Rings: The Return of the King
4. 300, Lucky Number Slevin

In [81]:
answer_ls.append(1)

In [82]:
data.quantile(0.99, numeric_only=True)['vote_average']

7.8

In [83]:
p1df = data[['original_title','vote_average']].sort_values('vote_average',ascending=False)

p1df[p1df.vote_average > data.quantile(0.99, numeric_only=True)['vote_average'] ]

                                     original_title  vote_average
600                                 The Dark Knight           8.1
125                              The Imitation Game           8.0
9                                        Inside Out           8.0
118                                    Interstellar           8.0
34                                             Room           8.0
1082  The Lord of the Rings: The Return of the King           7.9
873                                     The Pianist           7.9
1801                                        Memento           7.9
1192                               12 Years a Slave           7.9
128                                       Gone Girl           7.9
138                        The Grand Budapest Hotel           7.9
119                         Guardians of the Galaxy           7.9
1184                        The Wolf of Wall Street           7.9
370                                       Inception           7.9

In [84]:
# --- v2

p1df = data[['original_title','vote_average']].sort_values('vote_average',ascending=False)

p1df.head(19)  #  1890/100 = 19   :)

                                         original_title  vote_average
600                                     The Dark Knight           8.1
125                                  The Imitation Game           8.0
9                                            Inside Out           8.0
118                                        Interstellar           8.0
34                                                 Room           8.0
1082      The Lord of the Rings: The Return of the King           7.9
873                                         The Pianist           7.9
1801                                            Memento           7.9
1192                                   12 Years a Slave           7.9
128                                           Gone Girl           7.9
138                            The Grand Budapest Hotel           7.9
119                             Guardians of the Galaxy           7.9
1184                            The Wolf of Wall Street           7.9
370                                           Inception           7.9
316                                            3 Idiots           7.8
1564              Eternal Sunshine of the Spotless Mind           7.8
497   The Lord of the Rings: The Fellowship of the Ring           7.8
28                                            Spotlight           7.8
1214                                 Dallas Buyers Club           7.8

# 35. Какие актеры чаще всего снимаются в одном фильме вместе
Варианты ответа:
1. Johnny Depp & Helena Bonham Carter
2. Hugh Jackman & Ian McKellen
3. Vin Diesel & Paul Walker
4. Adam Sandler & Kevin James
5. Daniel Radcliffe & Rupert Grint

In [85]:
answer_ls.append(5)

In [86]:
data[data.cast.map(lambda x: True if (('Johnny Depp' in x)&('Helena Bonham Carter' in x)) else False)].imdb_id.count()

6

In [87]:
data[data.cast.map(lambda x: True if (('Hugh Jackman' in x)&('Ian McKellen' in x)) else False)].imdb_id.count()

5

In [88]:
data[data.cast.map(lambda x: True if (('Vin Diesel' in x)&('Paul Walker' in x)) else False)].imdb_id.count()

5

In [89]:
data[data.cast.map(lambda x: True if (('Adam Sandler' in x)&('Kevin James' in x)) else False)].imdb_id.count()

5

In [90]:
data[data.cast.map(lambda x: True if (('Daniel Radcliffe' in x)&('Rupert Grint' in x)) else False)].imdb_id.count()

8

# 36. У какого из режиссеров выше вероятность выпустить фильм в прибыли? (5 баллов)101
# У какого из режиссеров самый высокий процент фильмов со сборами выше бюджета? (так на skillfactory.ru)
Варианты ответа:
1. Quentin Tarantino
2. Steven Soderbergh
3. Robert Rodriguez
4. Christopher Nolan
5. Clint Eastwood

In [91]:
answer_ls.append(4)

In [92]:
dirdata = data[data.director.map(lambda x: True if ('Quentin Tarantino' in x) else False)]
dirdata[dirdata.profit > 0].imdb_id.count()  /  dirdata.imdb_id.count()

0.8571428571428571

In [93]:
dirdata = data[data.director.map(lambda x: True if ('Steven Soderbergh' in x) else False)]
dirdata[dirdata.profit > 0].imdb_id.count()  /  dirdata.imdb_id.count()

0.7692307692307693

In [94]:
dirdata = data[data.director.map(lambda x: True if ('Robert Rodriguez' in x) else False)]
dirdata[dirdata.profit > 0].imdb_id.count()  /  dirdata.imdb_id.count()

0.7272727272727273

In [95]:
dirdata = data[data.director.map(lambda x: True if ('Christopher Nolan' in x) else False)]
dirdata[dirdata.profit > 0].imdb_id.count()  /  dirdata.imdb_id.count()

1.0

In [96]:
dirdata = data[data.director.map(lambda x: True if ('Clint Eastwood' in x) else False)]
dirdata[dirdata.profit > 0].imdb_id.count()  /  dirdata.imdb_id.count()

0.8333333333333334

# Submission

In [97]:
len(answer_ls)

36

In [98]:
pd.DataFrame({'Id':range(1,len(answer_ls)+1), 'Answer':answer_ls}, columns=['Id', 'Answer'])

    Id  Answer
0    1       4
1    2       2
2    3       3
3    4       2
4    5       1
5    6       5
6    7       2
7    8       1
8    9       4
9   10       5
10  11       3
11  12       1
12  13       3
13  14       4
14  15       5
15  16       1
16  17       3
17  18       3
18  19       2
19  20       1
20  21       4
21  22       2
22  23       3
23  24       1
24  25       5
25  26       1
26  27       4
27  28       2
28  29       5
29  30       2
30  31       5
31  32       5
32  33       3
33  34       1
34  35       5
35  36       4